using GameFrameX.Core.SqlSugar;
using GameFrameX.Entity.System;

namespace GameFrameX.Application.SeedData.System;

/// <summary>
/// 系统角色菜单表 表种子数据
/// </summary>
public class SysRoleMenuSeedData: ISqlSugarEntitySeedData<SysRoleMenu>
{
    /// <summary>
    /// 种子数据
    /// </summary>
    /// <returns></returns>
    public IEnumerable<SysRoleMenu> HasData()
    {
        string recordsJSON = @"
            [
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1300000000101,
			    ""SysMenu"": null,
			    ""Id"": 1300000000101
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1300000000111,
			    ""SysMenu"": null,
			    ""Id"": 1300000000102
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1300000000121,
			    ""SysMenu"": null,
			    ""Id"": 1300000000103
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000101,
			    ""SysMenu"": null,
			    ""Id"": 1300000000111
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000111,
			    ""SysMenu"": null,
			    ""Id"": 1300000000121
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000112,
			    ""SysMenu"": null,
			    ""Id"": 1300000000122
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000113,
			    ""SysMenu"": null,
			    ""Id"": 1300000000123
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000114,
			    ""SysMenu"": null,
			    ""Id"": 1300000000124
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000115,
			    ""SysMenu"": null,
			    ""Id"": 1300000000125
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000116,
			    ""SysMenu"": null,
			    ""Id"": 1300000000126
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000117,
			    ""SysMenu"": null,
			    ""Id"": 1300000000127
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000118,
			    ""SysMenu"": null,
			    ""Id"": 1300000000128
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000119,
			    ""SysMenu"": null,
			    ""Id"": 1300000000129
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000120,
			    ""SysMenu"": null,
			    ""Id"": 1300000000130
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000131,
			    ""SysMenu"": null,
			    ""Id"": 1300000000141
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000132,
			    ""SysMenu"": null,
			    ""Id"": 1300000000142
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000133,
			    ""SysMenu"": null,
			    ""Id"": 1300000000143
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000134,
			    ""SysMenu"": null,
			    ""Id"": 1300000000144
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000135,
			    ""SysMenu"": null,
			    ""Id"": 1300000000145
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000136,
			    ""SysMenu"": null,
			    ""Id"": 1300000000146
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000137,
			    ""SysMenu"": null,
			    ""Id"": 1300000000147
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000138,
			    ""SysMenu"": null,
			    ""Id"": 1300000000148
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000141,
			    ""SysMenu"": null,
			    ""Id"": 1300000000151
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000142,
			    ""SysMenu"": null,
			    ""Id"": 1300000000152
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000143,
			    ""SysMenu"": null,
			    ""Id"": 1300000000153
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000144,
			    ""SysMenu"": null,
			    ""Id"": 1300000000154
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000145,
			    ""SysMenu"": null,
			    ""Id"": 1300000000155
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000151,
			    ""SysMenu"": null,
			    ""Id"": 1300000000161
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000152,
			    ""SysMenu"": null,
			    ""Id"": 1300000000162
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000153,
			    ""SysMenu"": null,
			    ""Id"": 1300000000163
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000154,
			    ""SysMenu"": null,
			    ""Id"": 1300000000164
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000155,
			    ""SysMenu"": null,
			    ""Id"": 1300000000165
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000161,
			    ""SysMenu"": null,
			    ""Id"": 1300000000171
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000162,
			    ""SysMenu"": null,
			    ""Id"": 1300000000172
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000163,
			    ""SysMenu"": null,
			    ""Id"": 1300000000173
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000164,
			    ""SysMenu"": null,
			    ""Id"": 1300000000174
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000165,
			    ""SysMenu"": null,
			    ""Id"": 1300000000175
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000171,
			    ""SysMenu"": null,
			    ""Id"": 1300000000181
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000172,
			    ""SysMenu"": null,
			    ""Id"": 1300000000182
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000173,
			    ""SysMenu"": null,
			    ""Id"": 1300000000183
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000174,
			    ""SysMenu"": null,
			    ""Id"": 1300000000184
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000175,
			    ""SysMenu"": null,
			    ""Id"": 1300000000185
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000176,
			    ""SysMenu"": null,
			    ""Id"": 1300000000186
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000177,
			    ""SysMenu"": null,
			    ""Id"": 1300000000187
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000181,
			    ""SysMenu"": null,
			    ""Id"": 1300000000191
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000182,
			    ""SysMenu"": null,
			    ""Id"": 1300000000192
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000183,
			    ""SysMenu"": null,
			    ""Id"": 1300000000193
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000184,
			    ""SysMenu"": null,
			    ""Id"": 1300000000194
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000185,
			    ""SysMenu"": null,
			    ""Id"": 1300000000195
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000351,
			    ""SysMenu"": null,
			    ""Id"": 1300000000251
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000352,
			    ""SysMenu"": null,
			    ""Id"": 1300000000252
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000353,
			    ""SysMenu"": null,
			    ""Id"": 1300000000253
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000354,
			    ""SysMenu"": null,
			    ""Id"": 1300000000254
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000355,
			    ""SysMenu"": null,
			    ""Id"": 1300000000255
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000361,
			    ""SysMenu"": null,
			    ""Id"": 1300000000261
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000371,
			    ""SysMenu"": null,
			    ""Id"": 1300000000271
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000372,
			    ""SysMenu"": null,
			    ""Id"": 1300000000272
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000373,
			    ""SysMenu"": null,
			    ""Id"": 1300000000273
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000381,
			    ""SysMenu"": null,
			    ""Id"": 1300000000281
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000382,
			    ""SysMenu"": null,
			    ""Id"": 1300000000282
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000383,
			    ""SysMenu"": null,
			    ""Id"": 1300000000283
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000384,
			    ""SysMenu"": null,
			    ""Id"": 1300000000284
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000385,
			    ""SysMenu"": null,
			    ""Id"": 1300000000285
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000386,
			    ""SysMenu"": null,
			    ""Id"": 1300000000286
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000391,
			    ""SysMenu"": null,
			    ""Id"": 1300000000291
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000392,
			    ""SysMenu"": null,
			    ""Id"": 1300000000292
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000393,
			    ""SysMenu"": null,
			    ""Id"": 1300000000293
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000394,
			    ""SysMenu"": null,
			    ""Id"": 1300000000294
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000395,
			    ""SysMenu"": null,
			    ""Id"": 1300000000295
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000396,
			    ""SysMenu"": null,
			    ""Id"": 1300000000296
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000511,
			    ""SysMenu"": null,
			    ""Id"": 1300000000311
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000512,
			    ""SysMenu"": null,
			    ""Id"": 1300000000312
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000513,
			    ""SysMenu"": null,
			    ""Id"": 1300000000313
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000521,
			    ""SysMenu"": null,
			    ""Id"": 1300000000321
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000522,
			    ""SysMenu"": null,
			    ""Id"": 1300000000322
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000523,
			    ""SysMenu"": null,
			    ""Id"": 1300000000323
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000524,
			    ""SysMenu"": null,
			    ""Id"": 1300000000324
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000531,
			    ""SysMenu"": null,
			    ""Id"": 1300000000331
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000532,
			    ""SysMenu"": null,
			    ""Id"": 1300000000332
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000543,
			    ""SysMenu"": null,
			    ""Id"": 1300000000333
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000701,
			    ""SysMenu"": null,
			    ""Id"": 1300000000401
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000711,
			    ""SysMenu"": null,
			    ""Id"": 1300000000402
			  },
			  {
			    ""RoleId"": 1300000000101,
			    ""MenuId"": 1310000000712,
			    ""SysMenu"": null,
			    ""Id"": 1300000000403
			  },
			  {
			    ""RoleId"": 1300000000102,
			    ""MenuId"": 1300000000101,
			    ""SysMenu"": null,
			    ""Id"": 1300000000501
			  },
			  {
			    ""RoleId"": 1300000000102,
			    ""MenuId"": 1300000000111,
			    ""SysMenu"": null,
			    ""Id"": 1300000000502
			  },
			  {
			    ""RoleId"": 1300000000102,
			    ""MenuId"": 1300000000121,
			    ""SysMenu"": null,
			    ""Id"": 1300000000503
			  },
			  {
			    ""RoleId"": 1300000000102,
			    ""MenuId"": 1310000000142,
			    ""SysMenu"": null,
			    ""Id"": 1300000000511
			  },
			  {
			    ""RoleId"": 1300000000102,
			    ""MenuId"": 1310000000161,
			    ""SysMenu"": null,
			    ""Id"": 1300000000521
			  },
			  {
			    ""RoleId"": 1300000000102,
			    ""MenuId"": 1310000000162,
			    ""SysMenu"": null,
			    ""Id"": 1300000000522
			  },
			  {
			    ""RoleId"": 1300000000102,
			    ""MenuId"": 1310000000163,
			    ""SysMenu"": null,
			    ""Id"": 1300000000523
			  },
			  {
			    ""RoleId"": 1300000000102,
			    ""MenuId"": 1310000000164,
			    ""SysMenu"": null,
			    ""Id"": 1300000000524
			  },
			  {
			    ""RoleId"": 1300000000102,
			    ""MenuId"": 1310000000165,
			    ""SysMenu"": null,
			    ""Id"": 1300000000525
			  },
			  {
			    ""RoleId"": 1300000000103,
			    ""MenuId"": 1300000000101,
			    ""SysMenu"": null,
			    ""Id"": 1300000000601
			  },
			  {
			    ""RoleId"": 1300000000103,
			    ""MenuId"": 1300000000111,
			    ""SysMenu"": null,
			    ""Id"": 1300000000602
			  },
			  {
			    ""RoleId"": 1300000000103,
			    ""MenuId"": 1300000000121,
			    ""SysMenu"": null,
			    ""Id"": 1300000000603
			  },
			  {
			    ""RoleId"": 1300000000103,
			    ""MenuId"": 1310000000142,
			    ""SysMenu"": null,
			    ""Id"": 1300000000611
			  },
			  {
			    ""RoleId"": 1300000000103,
			    ""MenuId"": 1310000000161,
			    ""SysMenu"": null,
			    ""Id"": 1300000000621
			  },
			  {
			    ""RoleId"": 1300000000103,
			    ""MenuId"": 1310000000162,
			    ""SysMenu"": null,
			    ""Id"": 1300000000622
			  },
			  {
			    ""RoleId"": 1300000000103,
			    ""MenuId"": 1310000000163,
			    ""SysMenu"": null,
			    ""Id"": 1300000000623
			  },
			  {
			    ""RoleId"": 1300000000103,
			    ""MenuId"": 1310000000164,
			    ""SysMenu"": null,
			    ""Id"": 1300000000624
			  },
			  {
			    ""RoleId"": 1300000000103,
			    ""MenuId"": 1310000000165,
			    ""SysMenu"": null,
			    ""Id"": 1300000000625
			  },
			  {
			    ""RoleId"": 1300000000104,
			    ""MenuId"": 1300000000101,
			    ""SysMenu"": null,
			    ""Id"": 1300000000701
			  },
			  {
			    ""RoleId"": 1300000000104,
			    ""MenuId"": 1300000000111,
			    ""SysMenu"": null,
			    ""Id"": 1300000000702
			  },
			  {
			    ""RoleId"": 1300000000104,
			    ""MenuId"": 1300000000121,
			    ""SysMenu"": null,
			    ""Id"": 1300000000703
			  },
			  {
			    ""RoleId"": 1300000000104,
			    ""MenuId"": 1310000000142,
			    ""SysMenu"": null,
			    ""Id"": 1300000000711
			  },
			  {
			    ""RoleId"": 1300000000104,
			    ""MenuId"": 1310000000161,
			    ""SysMenu"": null,
			    ""Id"": 1300000000721
			  },
			  {
			    ""RoleId"": 1300000000104,
			    ""MenuId"": 1310000000162,
			    ""SysMenu"": null,
			    ""Id"": 1300000000722
			  },
			  {
			    ""RoleId"": 1300000000104,
			    ""MenuId"": 1310000000163,
			    ""SysMenu"": null,
			    ""Id"": 1300000000723
			  },
			  {
			    ""RoleId"": 1300000000104,
			    ""MenuId"": 1310000000164,
			    ""SysMenu"": null,
			    ""Id"": 1300000000724
			  },
			  {
			    ""RoleId"": 1300000000104,
			    ""MenuId"": 1310000000165,
			    ""SysMenu"": null,
			    ""Id"": 1300000000725
			  },
			  {
			    ""RoleId"": 1300000000105,
			    ""MenuId"": 1300000000101,
			    ""SysMenu"": null,
			    ""Id"": 1300000000801
			  },
			  {
			    ""RoleId"": 1300000000105,
			    ""MenuId"": 1300000000111,
			    ""SysMenu"": null,
			    ""Id"": 1300000000802
			  },
			  {
			    ""RoleId"": 1300000000105,
			    ""MenuId"": 1300000000121,
			    ""SysMenu"": null,
			    ""Id"": 1300000000803
			  },
			  {
			    ""RoleId"": 1300000000105,
			    ""MenuId"": 1310000000142,
			    ""SysMenu"": null,
			    ""Id"": 1300000000811
			  },
			  {
			    ""RoleId"": 1300000000105,
			    ""MenuId"": 1310000000161,
			    ""SysMenu"": null,
			    ""Id"": 1300000000821
			  },
			  {
			    ""RoleId"": 1300000000105,
			    ""MenuId"": 1310000000162,
			    ""SysMenu"": null,
			    ""Id"": 1300000000822
			  },
			  {
			    ""RoleId"": 1300000000105,
			    ""MenuId"": 1310000000163,
			    ""SysMenu"": null,
			    ""Id"": 1300000000823
			  },
			  {
			    ""RoleId"": 1300000000105,
			    ""MenuId"": 1310000000164,
			    ""SysMenu"": null,
			    ""Id"": 1300000000824
			  },
			  {
			    ""RoleId"": 1300000000105,
			    ""MenuId"": 1310000000165,
			    ""SysMenu"": null,
			    ""Id"": 1300000000825
			  }
			]
        ";
        List<SysRoleMenu> records = Newtonsoft.Json.JsonConvert.DeserializeObject<List<SysRoleMenu>>(recordsJSON);
        
        // 后处理数据的特殊字段
		//for (int i = 0; i < records.Count; i++) { }

        return records;
    }
}